{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20210715-portable-world-content","package":null,"title":null,"status":"accepted","supersededBy":null,"tags":[],"deciders":[],"body":{"enhancedMdx":"### Context and Problem Statement\n\nIndependent meta-verses (virtual worlds) lack content because their communities are too small to fund much content work.\n\n\n### Describe the feature / enhancement and how it helps to overcome the problem or limitation\n\nCollaborate with Mozilla Hub's Spoke Editor and OMI Group's glTF2 extensions to have portable world content.\n\n### Describe how your proposal will work, with code, pseudo-code, mock-ups, and/or diagrams\n\nProvide basic glTF2 extensions. Here is an initial list.\n\n1. URI scene linking\n2. Archive binary format\n3. Audio emitters\n\n### If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nThere are many moving parts and a web client, which is not a few lines of code.\n\n### Positive Consequences\n\n* Easier creation of new virtual worlds.\n* Encourage remixing content\n* Keeping old content portable to new virtual worlds\n\n### Negative Consequences\n\n* Have to find different monetization means for independent virtual worlds\n\n### Is there a reason why this should be core and done by us?\n\nNo one is doing it.\n\n### References\n\n- https://github.com/ubisoft/mixer/issues/19\n\n### Derivative License\n\nCopyright (c) 2020-2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-07-15T05:45:12.000Z","lastEditDate":"2021-07-15T05:45:12.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20210715-portable-world-content.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20210715-portable-world-content.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20210715-portable-world-content.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}