{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20210811-sandstorm","package":null,"title":"Soiree using Sandstorm system","status":"accepted","supersededBy":null,"tags":[],"deciders":[],"body":{"enhancedMdx":"\n### Context and Problem Statement\n\nV-Sekai aspires to be an open source 3d virtual world platform that has VR and desktop modes.\n\nWe want to make it easy to deploy V-Sekai in Soiree mode.\n\n### Describe the feature / enhancement and how it helps to overcome the problem or limitation\n\nWe package V-Sekai in Soiree Party mode, so it is easier to test the system. \n\nA Soiree is a party or gathering, typically in a private house, for conversation or music.\n\n#### Risks\n\nSandstorm network access APIs may not work for the use case.\n\nIn most cases, things that run over plain HTTP requests should be able to work, but other network protocols tend to be nontrivial.\n\nSandstorm at current would neither support WebRTC or UDP traffic through the Powerbox, but it is uncertain what is needed to add it.\n\nRisk to migrate the Sandstorm ecosystem to Kubernetes helm system to match the devops status quo. Vargrant is not the status quo.\n\n##### Proxying\n\nSome udp based proxying methods are known\n\n1. https://github.com/yyyar/gobetween for standalone \n2. cillium for kubernetes\n3. WebRTC ice, stun, turn\n\n### Describe how your proposal will work, with code, pseudo-code, mock-ups, and/or diagrams\n\n#### V-Sekai Developers\n\nWe package V-Sekai in Soiree party mode.\n\n1. We start a single server of CockroachDB SQL database and not the default 3 server mode.\n2. We provide installs of the Godot game engine client and server.\n3. We re-arrange our elixir application Uro to work as a Sandstorm.io application.\n\n#### V-Sekai Packages\n\n1. V-Sekai provides a Server Download Package connecting via PowerBox.\n2. V-Sekai a Client Download Package connecting via PowerBox.\n3. V-Sekai a Uro Download Package connecting via PowerBox.\n\nThere is an open question if V-Sekai sandbox design works with powerbox.\n\n#### Player and Hosts\n\n1. Individual hosts of Sandstorm.io can start their own grains of V-Sekai in Soiree mode.\n1. Players download the Godot Engine client and play.\n\n#### Hosts \n\n1. Must provide a way to access the Godot Engine server and the Sandstorm server.\n\n### If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nIt is not trivial and not a few lines to implement a distributed system for a developer.\n\n### Positive Consequences\n\nSelf-hosted is a feature.\n\nWe can use Soiree Party mode to test V-Sekai.\n\n### Negative Consequences\n\nMaybe too complicated for the developers.\n\n### Is there a reason why this should be core and done by us?\n\nWe are investigating how to implement the Soiree Party mode.\n\n### References\n\n* https://www.cockroachlabs.com/\n* https://github.com/V-Sekai/uro\n* https://docs.sandstorm.io/en/latest/developing/powerbox/\n* https://docs.sandstorm.io/en/latest/vagrant-spk/services/\n* https://github.com/sandstorm-io/sandstorm\n* https://github.com/mrmetaverse/soiree\n\n### Derivative License\n\nCopyright (c) 2020-2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-08-11T02:21:38.000Z","lastEditDate":"2021-08-11T02:36:18.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20210811-sandstorm.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20210811-sandstorm.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20210811-sandstorm.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}