{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20211229-run-meetings-using-lean-coffee","package":null,"title":"Run meetings using Lean Coffee","status":"draft","supersededBy":null,"tags":["v-sekai",""],"deciders":["V-Sekai","Mr. Metaverse","fire",""],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nMeetings need to be ran better than randomly.\n\n## Describe the proposed option and how it helps to overcome the problem or limitation\n\nLean coffee can improve on meetings.\n\n## Describe how your proposal will work, with code, pseudo-code, mock-ups, or diagrams\n\nThree column kanban board. To discuss, discussing, and discussed. \n\nHave everyone add cards for topics they want to discuss. It may take 2-3 min for people to get into the Trello board. Once in take 2-3 min to add topics to the left column. \n\nThen have everyone vote, each person gets 2-3 votes. To vote, they should click the card of a topic to discuss and in the comments type \"+\". Be sure nobody else adds any other comments until we begin discussing the cards. \n\nLast, sort the cards by number of comments (most amount of + go to top) and then one by one drag in the top card to \"discussing\". Set a timer for 5 minutes. After 5 minutes the group votes to keep discussing or to move on. While discussing the group can add comments or links to the card while discussing.\n\n## Positive Consequences <!-- optional -->\n\n- Organized meetings are better\n\n## Negative Consequences <!-- optional -->\n\n- Can be strange to use because it's not common.\n\n## Option graveyard: <!-- same as above -->\n\n- Option: Gather for one hour randomly.\n- Rejection Reason: We can do better.\n\n## If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nNot code.\n\n## Is there a reason why this should be core and done by us?\n\nWe need to run better meetings.\n\n## References <!-- optional and numbers of links can vary -->\n\n- https://leanchange.org/resources/leancoffee\n\n## Derivative License\n\nCopyright (c) 2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-12-30T00:43:27.000Z","lastEditDate":"2022-01-01T20:10:39.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20211229-run-meetings-using-lean-coffee.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20211229-run-meetings-using-lean-coffee.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20211229-run-meetings-using-lean-coffee.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}