{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20210724-Spreadsheet-animation-preview","package":null,"title":"Spreadsheet Animation Preview","status":"accepted","supersededBy":null,"tags":[],"deciders":[],"body":{"enhancedMdx":"\n### Context and Problem Statement\n\nWorkflow for QA testing animations\n\n### Describe the feature / enhancement and how it helps to overcome the problem or limitation\n\nLoad in a spreadsheet dataview of animation tracks and play animation back.\n\n### Describe how your proposal will work, with code, pseudo-code, mock-ups, and/or diagrams\n\nWork on https://github.com/V-Sekai/godot-hop-spin-dance.\n\n- Display a spreadsheet view.\n\n| Key | EN  | Animation | Queue Play |\n| --- | --- | --------- | ---------- |\n|     |     |           |            |\n\n- Show the debug animation tree.\n\n- Show graphical playback on a VRM character\n\n### If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nNot trivial, combines a spreadsheet with animations, an animation tree debugger and a animation player.\n\n### Positive Consequences\n\nAble to QA animations easier.\n\n### Negative Consequences\n\nA sizable amount of work.\n\n### Is there a reason why this should be core and done by us?\n\nWe care about characters.\n\n### References\n\nGDC 2021 Summer:\n\n- 'Genshin Impact': Building a Scalable AI System\n  This session reviews some of AI programming challenges in developing open-world game 'Genshin Impact' and describes several handful methods to improve AI system scalability. It details an AI framework and production pipeline that allow designers to craft huge amount of AI archetypes quickly and flexibly. Next, Genshin's pathfinding service is introduced, an approach to reduce NavMesh disk and memory space overhead, caused by continuously-growing world map. Finally, this session discusses AI performance optimization and shows how AI system can be modularized and broke down into multi-threaded tasks on CPU.\n- Emotional Systemic Facial of 'Last of Us Part II'\n  As graphic fidelity in video games has rapidly accelerated, one aspect of development has overwhelmingly remained stagnant; in-game character emotions. In this talk, Naughty Dog explores how they addressed this industry wide limitation in The Last of Us Part II. Represented by team members from character rigging, animation, dialogue, and design; this talk comprehensively covers how character emotion was brought into gameplay ranging from nuanced narrative moments to adrenaline charged melee combat. Learn about the challenges, implementation, and innovation that occurred to develop the systemic emotion system that brought over 65 characters speaking 13 languages with up to 20 individual emotions to life.\n- Motion Matching in 'The Last of Us Part II'\n  Naughty Dog is known for the animation quality of their titles. For The Last of Us Part II, they decided to take a leap of faith and switch to at that time pretty experimental animation system called Motion Matching. Two Naughty Dog technical animators will tell you the story of initial joy, later frustration and ultimate fear as the development of the new project went on and but not everything went according to plan. Thanks to many clever solution, hard work and a very talented team, Naughty Dog was able to ship a game that was unanimously praised for animation quality among critics and players.\n- https://tabletomarkdown.com/convert-spreadsheet-to-markdown/\n- https://github.com/deflinhec/GodotGoogleSheet\n- https://baserow.io/\n- https://github.com/fenix-hub/godot-engine.easy-charts\n- https://github.com/godotengine/godot/pull/32408\n\n### Derivative License\n\nCopyright (c) 2020-2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-07-24T21:23:20.000Z","lastEditDate":"2021-11-30T19:35:23.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20210724-Spreadsheet-animation-preview.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20210724-Spreadsheet-animation-preview.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20210724-Spreadsheet-animation-preview.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}