{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20210523-distribute-trusted-clients-with-notary","package":null,"title":"Distribute trusted clients with notary","status":"accepted","supersededBy":null,"tags":[],"deciders":[],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nWe use itch.io distribute our software clients.\n\n1. Security concerns with trust. We do not control hosting.\n1. Want ability to mirror package sources.\n1. Research use to distribute avatars and worlds\n1. Want something off the shelf\n\n## Describe the proposed option and how it helps to overcome the problem or limitation\n\nUse the notary system so we can establish trust.\n\n### Describe how your proposal will work, with code, pseudo-code, mock-ups, and/or diagrams\n\nWe distribute the notary updater and make it fetch the launcher and V-Sekai.\n\nWe provide a notary server.\n\nWe setup the trust relationship during the install and maintance.\n\n### Positive Consequences <!-- optional -->\n\n- Code reviewed and trusted by large corporations (Docker Images) and in safety critial fields (Automobiles)\n- Off the shelf\n\n### Negative Consequences <!-- optional -->\n\n- Unknown support costs\n\n## Option graveyard Steam only\n\nSteam provides a distribution network and marketplace.\n\nList the reasons for the rejection: (the Bad traits)\n\n* Third party trust\n\n## Option graveyard Itch.io only\n\nItch.io provides a distribution network and marketplace.\n\nList the reasons for the rejection: (the Bad traits)\n\n* Third party trust\n\n## If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nNot trivial. The documentaion of Notary start by the description of a possible security model and provides several attacks against it.\n\n## Is there a reason why this should be core and done by us?\n\nFrom a security standpoint, we need to ensure that there is a trust between the software we send and the client supply chain to get it.\n\n## References <!-- optional -->\n\n- https://github.com/kolide/updater\n- https://github.com/theupdateframework/notary\n- https://github.com/theupdateframework/specification/blob/master/tuf-spec.md\n\n## Derivative License\n\nCopyright (c) 2020-2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-05-24T06:25:58.000Z","lastEditDate":"2021-11-30T19:26:08.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20210523-distribute-trusted-clients-with-notary.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20210523-distribute-trusted-clients-with-notary.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20210523-distribute-trusted-clients-with-notary.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}