{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20200729-entity-networking","package":null,"title":"Adding Entity Networking to Groups","status":"accepted","supersededBy":null,"tags":[],"deciders":["V-Sekai","Lyuma","SaracenOne"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nFor Groups, this system aims to solve the following issues:\n\n- **(A)** Need a way to standardize scene spawning.\n- **(B)** Need a way to refer to nodes/instances that is consistent across clients (for example, \"Set parent to ...\").\n- **(C)** Need a way to synchronize state between clients.\n- **(D)** Provides a basic set of standard protocols and interactions.\n- **(E)** Provides the basis for a security/privacy model regarding entity communication/permissions over the network.\n- **(F)** Provides a security model locally for access between nodes of one entity and nodes of another entity (assuming a secure scripting framework is implemented).\n- **(G)** This also solves the problem of abstracting away implementation details of entities; for example, there should be no need to deal with _Godot nodes_ on an individual basis.\n- **(H)** Provide a unified way to create top-level physics hierarchies isolated from other game logic.\n\nNote: This proposal covers three **Spawn Types**:\n\n- Spawn type **(i)** Entities integrated into a map;\n- Spawn type **(ii)** map entities spawned by clients; and\n- Spawn type **(iii)** avatar entities/props spawned by clients.)\n\n## Describe the proposed option and how it helps to overcome the problem or limitation\n\nAs indicated in point (G), everything documented here relates to Scenes and Entities. Aside from the Entity script being attached to the root node of a scene(?), and the scene itself being a node. Additionally, it may be necessary to query a node to find its containing entity (parent node).\nNote: Interaction between nodes _within_ a single entity is considered an implementation detail of that entity and is out of the scope of the entity system. Any security model assumes that nodes cannot be transferred, shared or reparented between entities.\n\nEntities are objects known to the server and with explicit handling for state synchronization.\n\nSome entities may choose to synchronize little state, or position only, or no state at all.\nAlso, some entities may choose to provide no security or isolation, while others may be private and appear not to even exist to other nodes. For example, a local player menu built upon the Entity System's interaction features, gaining features A, D, F and G.\nBy building this common framework, it means that systems built as Entities can be trivially synchronized over the network.\n\n## Describe how your proposal will work, with code, pseudo-code, mock-ups, and/or diagrams\n\n**Todo**: We may want a way to optimistically spawn an entity client-side to achieve maximal responsiveness and fun.\n\nHowever, these entities will not yet know their server-side entity ID. Proposals: Reserve portion of ID space; or locally hold onto events/state and flush once the ID is known.\n\n### A. Spawning\n\nThere will be a global directory of spawnable objects as part of a server connection.\nPlayers and maps can reference scenes by some name to spawn an entity with that name.\n\n### B. Consistent References\n\nEntities will have a server-assigned ID.\n**Todo**: What to do if an entity is spawned locally and an ID is not yet known.\n\n### C. State Synchronization\n\nEntities will define a set of state variables that must be synced.\nThe network protocol will take care of updating the state gradually over time, as well as rate-limiting.\nEvents can be used to provide forced updates.\nGuarantees? Exposing metadata about when the state was updated?\n\n**Entity properties:**\n\n- State that is synced is properties.\n- Some properties are only assignable at spawn time (for example, scene file?)\n- Some properties such as transform may require special handling.\n\nUpdate intervals:\n\nEntity refreshing / full state synchronization & serialization:\n\nDelta encoding & ACK protocol:\n\nWhen to use reliable events vs. \"unreliable\" (eventual) state synchronization: Events as a means for state synchronization.\n\n### D. Standard Interaction Protocols\n\nTODO: What classes / bespoke types exist?\nExamples: Physics, Physics Pickup; Button; Movable Platform; Vehicle\n\n### E. Network Security Model:\n\n**Concepts:**\n\n**Ownership:**\n\nAll entities will be owned by the player who interacts with them or by the server.  \nEntity ownership will be transferred if the current owner leaves.\n\n**Mastership:**\n\nMap entities may largely be mastered by a dedicated server.\n\nAvatar entities and props will be mastered by the player that spawned them, even if another player owns them.\n\n(Example: Alice personally spawns a ball avatar prop and throws it to Bob, who catches it. Alice has Mastership; Bob has Ownership.)  \nMastership may be transferred on map exit; or they may be despawned (the player \"takes\" their props with them.)\n\nPrivacy: Entities may reveal very little state to the network. Are there cases where different players may be given different permissions?\n\nExample: Cooperative game, in which state is shared between some players but not others.\n\nExample: Team Melee\n\n### F. Inter-entity Isolation\n\nScript-level guarantees that information about other entities is either restricted or absent entirely.  \nIt may require a custom scripting language to achieve these guarantees fully.\n\n### G. Abstraction\n\nNot much to say here. We should see as little as possible built on top of pure Godot Nodes, except as a means for providing the entity's functions.\n\n### H. Physics\n\nEntities will not be allowed to contain physics objects within the node hierarchy. Instead, physics objects must be _attached_ to the entity in specific ways.  \nQuestions: how does this work with PhysicalBone; how are physics objects linked to the entity; what about animations? (scale, rotation, skeleton attachments driving physical bodies?)\n\n### Spawn Type (i). Map builtins\n\nMaps will have entities that might not be spawnable but will be automatically created and referenced within the parent scene.  \nFor example, a button/door; or a state \"god object\"; or physics objects; built-in TV screens.\n\n### Spawn Type (ii). Map spawns\n\nMaps will provide a directory of map-spawnable scene references, which can be instantiated in response to events.  \nThese will usually have specific functions within a particular map.  \nExamples: Game-specific weapons; Keys; Buildings constructed\n\n### Spawn Type (iii). Avatar spawns\n\nPlayers may also provide a directory of avatar-spawnable scenes; Additionally, a prop database may exist or be negotiated.  \nThese may include local UIs; weapons, pencils; media players; pets (parrots, mounts); vehicles; flight mechanics (wings?); visual effects.\n\n### Notes about Entity parenting:\n\nNodePath references (../) out of an entity hierarchy must be disallowed.\nParenting should be implemented carefully: If nodes are literally parented to another entity (e.g. vehicles), NodePath references could expose implementation details from one entity to another entity.\n\nPart of a solution to this is to provide Attachment points as a feature of an Entity, but this needs to be implemented carefully to prevent unusual situations, for example, parent entity/node is destroyed (`queue_free()`) or removed from the scene tree (`remove_child()`); or animation paths referencing a node of the child entity.\n\n## Positive Consequences List <!-- optional -->\n\n- Possibility of:\n  - vehicle games\n  - bow and arrow games\n  - pickup of balls\n\n## Negative Consequences List <!-- optional -->\n\n- Complexity\n\n## If this enhancement will not be used often, can it be worked around with a few lines of script?\n\n## Is there a reason why this should be core and done by us?\n\nYes, this is the foundation of the protocol and the basic set of nodes and behavior upon which content will be created.\n\n## References <!-- optional -->\n\nAldridge, David. \"I Shot You First: networking the Gameplay of Halo: Reach\". GDC 2011. https://www.youtube.com/watch?v=h47zZrqjgLc\n\nFiedler, Glenn. \"Networking for Physics Programmers\". GDC 2015. https://www.youtube.com/watch?v=Z9X4lysFr64\n\nFiedler, Glenn. \"Networked Physics in Virtual Reality\". 2018-02-22. https://www.gafferongames.com/post/networked_physics_in_virtual_reality/\n\nRouwe, Jorrit. \"Killzone Shadow Fall: Threading the Entity Update on PS4\". GDCEU 2014. https://archive.org/details/GDCEU2014Rouwe\n\nSaracen, text and voice discussions on Discord: search Discord for \"entity networking\" and \"networking model\"\n\n## Derivative License\n\nCopyright (c) 2020-2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-05-29T20:11:38.000Z","lastEditDate":"2021-11-30T19:35:23.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20200729-entity-networking.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20200729-entity-networking.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20200729-entity-networking.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}