{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20210601-store-presentation-and-book-content-via-lottie-2","package":null,"title":"Store presentation and book content via Lottie","status":"accepted","supersededBy":null,"tags":[],"deciders":[],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\n[Safety brochure in Lottie format]\n\nWe want to display book content and presentation content in groups.\n\nIf the original content is in vectorized format, we want to keep it.\n\nWe do not have enterprise levels of engineering power.\n\nLicenses have to be compatible with groups.\n\n## Describe the proposed option and how it helps to overcome the problem or limitation\n\nLottie via Samsung's rlottie library helps solve this problem. Lottie keeps pixel and curve data.\n\nRGBA8 data is big and Lottie keeps it as pixel and does not rasterize curves.\n\nLottie exports may turn fonts into curves.\n\nV-Sekai already has the rlottie implementation in Godot engine so engineering effort is minimized.\n\nrlottie is Groups license compatible.\n\n## Describe how your proposal will work, with code, pseudo-code, mock-ups, or diagrams\n\n### Offline export of lottie\n\n1. Install synfig-studio\n1. In synfig, for each page of pdf, epub, and others export a lottie json per page\n1. Ensure the documents are sorted correctly\n1. Save the folder as zstd compress 7zip archive\n1. Name the archive `.cbzl` This is file that is similar to CBZ but has an extra l to make it easy to identify as Lottie.\n\n### Online import of lottie\n\n1. Open the zip.\n1. For each sorted entry of the zip\n1. Make a Godot Engine PackedScene using the Groups Lottie importer.\n\n## Positive Consequences <!-- optional -->\n\n- In engine presentation engine\n\n## Negative Consequences <!-- optional -->\n\n- Lottie is an obscure format\n\n## Option graveyard: <!-- same as above -->\n\n- Option: Create single executable Pdfium thing that writes to png\n- Rejection Reason:\n- Chromium build processes are difficult, but someone made a pdfium binary repository.\n\n- Option: Import pdfium into Godot Engine as a static library\n- Rejection Reason:\n- Adding pdf support to Godot Engine is difficult.\n- The straight-forward pdf implementation writes the RGBA8 data into the cache.\n\n- Option: Use Godot Engine's native SVG library\n- Rejection Reason:\n- Does not support pixel data.\n- Unreliable\n\n## If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nrlottie and pdf formats are complicated.\n\n## Is there a reason why this should be core and done by us?\n\nPresentations and books should be a first-class feature in groups.\n\n## References <!-- optional -->\n\n- https://www.synfig.org/\n- https://github.com/Samsung/rlottie\n- https://github.com/godot-extended-libraries/lottie\n- https://www.adobe.com/products/aftereffects.html\n- https://airbnb.io/lottie/#/\n- https://lottiefiles.com/\n- https://github.com/reMarkable/pdfium-binaries\n\n## Derivative License\n\nCopyright (c) 2020-2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-06-01T16:17:50.000Z","lastEditDate":"2021-11-30T19:35:23.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20210601-store-presentation-and-book-content-via-lottie-2.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20210601-store-presentation-and-book-content-via-lottie-2.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20210601-store-presentation-and-book-content-via-lottie-2.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}