{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20211031-play-preprocessed-animations-on-any-vrm-model","package":null,"title":"Play preprocessed animations on any VRM model","status":"accepted","supersededBy":null,"tags":[],"deciders":[],"body":{"enhancedMdx":"\n### Context and Problem Statement\n\nGiven any vrm and a carefully made animation, we should be able to play back the animation.\n\n### Describe the feature / enhancement and how it helps to overcome the problem or limitation\n\nNeed to work out a flow for making animations play back on vrm.\n\n**This is dependency for a VRM based character controller that can play existing animation clips and blend them**\n\n### Describe how your proposal will work, with code, pseudo-code, mock-ups, and/or diagrams\n\n???\n\nCollaborate with Saracen on a bone roll corrected VRM skeleton.\n\nConvert animations to VRM named bones.\n\n### If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nNot trivial.\n\n### Positive Consequences\n\n_No response_\n\n### Negative Consequences\n\n_No response_\n\n### Is there a reason why this should be core and done by us?\n\nWe control the default animation tree, therefore we need to do this.\n\n### References\n\n- Proposal on baking blend shapes to linear skin blending.\n- Useful for tokage's character movement demo. https://github.com/TokageItLab/3d-platform-test-for-godot4\n- Free animations -- https://github.com/V-Sekai/shadermotion-video-to-anims\n\n### Derivative License\n\nCopyright (c) 2020-2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-11-01T03:48:11.000Z","lastEditDate":"2021-11-01T03:48:11.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20211031-play-preprocessed-animations-on-any-vrm-model.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20211031-play-preprocessed-animations-on-any-vrm-model.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20211031-play-preprocessed-animations-on-any-vrm-model.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}