{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20211103-use-a-standard-reference-platform-called-vfx-reference-platform","package":null,"title":"Use a standard reference platform called VFX Reference Platform","status":"draft","supersededBy":null,"tags":["v-sekai",""],"deciders":["V-Sekai","fire",""],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\n> [A standard reference platform's purpose is to] minimise incompatibilities between different software packages, ease the support burden for Linux-based pipelines and encourage further adoption of Linux by software vendors. \n\nHere are some problems:\n\n* We want to keep a consistent server configuration setup.\n* We want creators to have a consistent work environment.\n\n## Describe the proposed option and how it helps to overcome the problem or limitation\n\n> The VFX Reference Platform is a set of tool and library versions to be used as a common target platform for building software for the VFX industry. Its purpose is to minimise incompatibilities between different software packages, ease the support burden for Linux-based pipelines and encourage further adoption of Linux by software vendors. The Reference Platform is updated annually by a group of software vendors in collaboration with the Visual Effects Society Technology Committee.\n\n## Describe how your proposal will work, with code, pseudo-code, mock-ups, or diagrams\n\n1. Find candidate centos-like platforms.\n1. A candidate is Rocky Linux.\n\n## Positive Consequences <!-- optional -->\n\n- The problems with platforms are informed by decisions of others in the industry.\n\n## Negative Consequences <!-- optional -->\n\n- Going outside the platform is risky.\n\n## Option graveyard: <!-- same as above -->\n\n- Option: Use Rocky Linux directly\n- Rejection Reason: No collaboration\n\n- Option: Use Fedora 35 directly\n- Rejection Reason: Unclear support lifetime.\n\n## If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nThis is a devops proposal, not a coding proposal.\n\n## Is there a reason why this should be core and done by us?\n\nWe do have to choose a reference platform even if we don't think about it to upload to docker.\n\n## References <!-- optional -->\n\n- https://vfxplatform.com/\n\n## Derivative License\n\nCopyright (c) 2020-2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-11-04T05:00:12.000Z","lastEditDate":"2021-11-04T05:15:05.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20211103-use-a-standard-reference-platform-called-vfx-reference-platform.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20211103-use-a-standard-reference-platform-called-vfx-reference-platform.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20211103-use-a-standard-reference-platform-called-vfx-reference-platform.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}