{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20211108-integrate-with-blender","package":null,"title":"Integrate with blender","status":"draft","supersededBy":null,"tags":["v-sekai",""],"deciders":["V-Sekai",""],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nBlend files are too difficult to write an importer for in Godot Engine.\n\n## Describe the proposed option and how it helps to overcome the problem or limitation\n\nMake an addon that calls Blender directly and tell it to export to the proper place.\n\n## Describe how your proposal will work, with code, pseudo-code, mock-ups, or diagrams\n\n1. Enable addon\n1. Open blend\n1. See the blend as a Godot Engine scene.\n\n## Positive Consequences <!-- optional -->\n\n- Integrates Blender into Godot Engine workflows.\n- Downside of Blender version updates can be fixed by the use of the V-Sekai exporter tool.\n\n## Negative Consequences <!-- optional -->\n\n- Requires blender to export cicd.\n- Changes to the Blender version causes the project to desync.\n\n## Option graveyard: <!-- same as above -->\n\n- Option: <!-- [List the proposed options no longer open for consideration.] -->\n- Rejection Reason: <!-- [List the reasons for the rejection: (the Bad traits)] -->\n\n## If this enhancement will not be used often, can it be worked around with a few lines of script?\n\n- This is a script but not a few lines.\n\n## Is there a reason why this should be core and done by us?\n\nI know how to do this and others don't.\n\n## References <!-- optional -->\n\n- https://www.blender.org/\n- https://github.com/V-Sekai/godot-blender\n\n## Derivative License\n\nCopyright (c) 2020-2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-11-08T18:30:12.000Z","lastEditDate":"2021-11-09T02:37:09.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20211108-integrate-with-blender.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20211108-integrate-with-blender.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20211108-integrate-with-blender.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}