{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20211207-for-godot-engine-changes-use-a-decision-flowchart","package":null,"title":"For Godot Engine changes use a decision flowchart","status":"draft","supersededBy":null,"tags":["v-sekai",""],"deciders":["V-Sekai","fire","lyuma",""],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nWe have conflicts on how to merge Godot. We need to organize our strategies.\n\n## Describe the proposed option and how it helps to overcome the problem or limitation\n\nWe will write a decision flow chart on what to do.\n\n## Describe how your proposal will work, with code, pseudo-code, mock-ups, or diagrams\n\nIs it upstreamable?\n\nIf upstreamable, commit to your own godot fork, and submit a Godot PR.\n\nThen, add this commit into the .gitassembly\n\nIf not upstreamable, and intended as a V-Sekai specific feature, make the commit in the V-Sekai godot fork, don't submit a godot PR, and add to the .gitassembly.\n\nIf two upstreamable commits conflict, that is a godot problem because it implies the upstream open PRs would be broken if they both merged. There are two options:\n\nFirst, if the resolution to this merge conflict is itself something which must be upstreamed, a new PR should be opened or communication needs to happen between the PR maintainers.\n\nTemporarily, a new V-Sekai branch could be created which resolves this conflict while waiting for the upstream Godot maintainers to resolve the build issues.\n\nWorkflow for updating merge script.\n\n1. Make a local commit to merge-script-master\n2. Run the merge script\n3. If successful, push (might happen automatically)\n\n## Positive Consequences <!-- optional -->\n\n- Easier to remember solutions.\n\n## Negative Consequences <!-- optional -->\n\n- Loss of flexbility.\n\n## Option graveyard: <!-- same as above -->\n\n- Option: Do adhoc decisions.\n- Rejection Reason: Not a better strategy.\n\n## If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nThis is a workflow design.\n\n## Is there a reason why this should be core and done by us?\n\nOnly we care about our own policies.\n\n## References <!-- optional and numbers of links can vary -->\n\n## Derivative License\n\nCopyright (c) 2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-12-07T21:09:30.000Z","lastEditDate":"2021-12-07T21:21:19.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20211207-for-godot-engine-changes-use-a-decision-flowchart.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20211207-for-godot-engine-changes-use-a-decision-flowchart.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20211207-for-godot-engine-changes-use-a-decision-flowchart.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}