{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20211220-network-the-ubisoft-mixer-server","package":null,"title":"Network the Ubisoft Mixer server","status":"draft","supersededBy":null,"tags":["v-sekai",""],"deciders":["V-Sekai","fire",""],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nWe want to use the Ubisoft Mixer project more easily.\n\nThe Ubisoft mixer project is also a good way to share Godot Engine scenes.\n\nThe problem is the mixer project is in Python and doesn't have file sync.\n\n## Describe the proposed option and how it helps to overcome the problem or limitation\n\nMy proposed solution is to write a elixir server that syncs the Blender file and the file share.\n\n## Describe how your proposal will work, with code, pseudo-code, mock-ups, or diagrams\n\n1. Extract Mixer broadcaster code\n2. Write an Elixir udp based broadcaster with webrtc\n3. Write an Elixir file sync (SECURITY WARNING)\n\n## Positive Consequences <!-- optional -->\n\n- Easier to host mixer.\n\n## Negative Consequences <!-- optional -->\n\n- The software may be a vector for security attacks.\n\n## Option graveyard: <!-- same as above -->\n\n- Option: Use V-Sekai as a networking sync.\n- Rejection Reason: Not ready yet and someone is working on it.\n\n## If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nNot a few lines of script.\n\n## Is there a reason why this should be core and done by us?\n\nI know how to do this and no one else is doing it.\n\n## References <!-- optional and numbers of links can vary -->\n\n- https://github.com/ubisoft/mixer/issues\n\n## Derivative License\n\nCopyright (c) 2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-12-20T16:51:38.000Z","lastEditDate":"2021-12-20T16:51:38.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20211220-network-the-ubisoft-mixer-server.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20211220-network-the-ubisoft-mixer-server.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20211220-network-the-ubisoft-mixer-server.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}