{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"20211214-create-an-open-metaverse-by-working-on-v-sekai","package":null,"title":"Create an open metaverse by working on V-Sekai","status":"draft","supersededBy":null,"tags":["v-sekai",""],"deciders":["V-Sekai","lyuma","fire","MrMetaverse",""],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nV-Sekai is a VR virtual world platform.\n\n## Describe the proposed option and how it helps to overcome the problem or limitation\n\nBuild V-Sekai.\n\n- Spatialized audio and VOIP support\n- A custom networking stack\n- A security-focused sandboxed scripting environment backed by WASM\n- Customisable servers with their own individual game rules\n- Dependable for important presentations\n\n## Describe how your proposal will work, with code, pseudo-code, mock-ups, or diagrams\n\nAs a 3d world builder, I want to upload a world to invite my friends to experience (Voice Communication, Reliability, Networked) with me.\n\n1. Uninstalled: give a URL with a copy of the game.\n2. Installed: url to uro that sends an url\n   1. v-sekai://v-sekai.org/lyuma/home?key=asjdfhgdtg#68.4,1.4,0.34\n   1. Register windows protocol handler\n      ```\n      def register_protocol(proto, command):\n          import winreg\n          key = winreg.CreateKey(winreg.HKEY_CLASSES_ROOT, rf\"{proto}\")\n          winreg.SetValueEx(key, \"\", 0, winreg.REG_SZ, f\"URL:{proto} protocol\")\n          winreg.SetValueEx(key, \"URL Protocol\", 0, winreg.REG_SZ, \"\")\n          key = winreg.CreateKey(winreg.HKEY_CLASSES_ROOT, rf\"{proto}\\shell\\open\\command\")\n          winreg.SetValueEx(key, \"\", 0, winreg.REG_SZ, command)\n      ```\n\nAs an explorer, I want to browse a selection of places to visit.\n\nAs a user, I want to pick up objects to hand them to my friend.\n\nAs a user, I want to bring my identity (my avatar) to interact with in V-Sekai.\n\nAs a developer, I need V-Sekai to understand my needs to have an excellent developer-user experience.\n\nAs a creative, I want to edit my V-Sekai virtual environment to better suit my requirements and preferences.\n\nAs a person, I want to work with a group that shares my values.\n\nAs a person, I want to survive long enough to build V-Sekai.\n\n## Positive Consequences <!-- optional -->\n\n- It matters that we are here to create V-Sekai. I imagine a future where all the virtual world platforms are closed, with no space to create and remix.\n- We are making V-Sekai to serve people who want to create and be in the metaverse.\n\n## Negative Consequences <!-- optional -->\n\n- We are chosing Native VRM support so arbitrary 3d models aren't allowed.\n- We choose Native code on the devices, so we can't use the interoperability of the web.\n- We choose Godot Engine which is an open source game engine to own our dependencies, so it is hard to use off the shelf commercial technologies.\n- We prefer de facto or open standards for the most reach, so we may not be able to get the exact solution we want without effort.\n\n## Option graveyard: <!-- same as above -->\n\n- Option: Use dominant VR platforms.\n- Rejection Reason: At this moment. there is an opportunity to have a coalition of open metaverse.\n\n## If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nV-Sekai needs a strategy and not code.\n\n## Is there a reason why this should be core and done by us?\n\nWe are V-Sekai and only we can be who we want to be.\n\n## References <!-- optional and numbers of links can vary -->\n\n- https://www.fortressofdoors.com/so-you-want-to-compete-with-roblox/\n\n### Minimum Requirements to not Fail Right Away\n\n> You should consider the following as mere table stakes:\n> High-quality multiplayer support for user creations out of the box\n> High-performance servers with excellent reliability\n> Powerful, user-friendly, and joyful creation tools\n\n#### Other References\n\n- https://martinfowler.com/bliki/MonolithFirst.html\n- https://en.wikipedia.org/wiki/John_Gall_(author)\n- https://github.com/ubisoft/mixer Has Blender and Unity Support 2021-12-14. It needs to be debugged for Blender 3.0.\n\n## Derivative License\n\nCopyright (c) 2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-12-15T05:13:01.000Z","lastEditDate":"2021-12-15T05:13:01.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/20211214-create-an-open-metaverse-by-working-on-v-sekai.md","absolutePath":"/home/runner/work/v-sekai-proposals/v-sekai-proposals/docs/decisions/20211214-create-an-open-metaverse-by-working-on-v-sekai.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/v-sekai-proposals/blob/master/docs/decisions/20211214-create-an-open-metaverse-by-working-on-v-sekai.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}